config/Reports/ВедомостьПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ВедомостьПоТоварам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/AccumulationRegisters/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДисконтныеКарты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРознСоСк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерДК</Name>
					<Comment>Код ДК без контрольной суммы первые 12 цифр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Documents/РеализацияОптовая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияОптовая</Name>
			<Comment>Создается в 1С, для реализации юрлицам по оптовой цене с оптовых складов. Наценка формируется в момент отгрузки (отпускная цена не фиксирована)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТовара</xr:Item>
				<xr:Item>Document.ПеремещениеТовара</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииЖНВЛС</xr:Item>
				<xr:Item>AccumulationRegister.ПродажаОптом</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПоСтНДСПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоТипамДляЦО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОпт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузкиВБух</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕИТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕИТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэфф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСОпт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакуп</Name>
							<Comment>ЦенаЗакуп с ндс</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОптСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОпт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияНадДокументами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Reports/ВедомостьПоТоварам/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	УниверсальныйОтчет.ИмяРегистра = "ПартииЖНВЛС";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	ОписаниеВыборкиВидовДокументов = ""; ОписаниеОтборовВидовДокументов = "";
	УниверсальныйОтчет.ДобавитьВТекстЗапросаВидыДокументов(ОписаниеВыборкиВидовДокументов, ОписаниеОтборовВидовДокументов);
	
	// Описание исходного текста запроса.
	//ТекстЗапроса = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ИсточникДанных.Товар КАК Товар,
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Товар) КАК ТоварПредставление,
	//|	ИсточникДанных.Склад КАК Склад,
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Склад) КАК СкладПредставление,
	//|	ИсточникДанных.Партия КАК Партия,
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Партия) КАК ПартияПредставление,
	//|	ИсточникДанных.СтавкаНДС КАК СтавкаНДС,
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтавкаНДС) КАК СтавкаНДСПредставление,
	//|	ИсточникДанных.Фирма КАК Фирма,
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Фирма) КАК ФирмаПредставление,
	//|	ИсточникДанных.КолвоНачальныйОстаток КАК КолвоНачальныйОстаток,
	//|	ИсточникДанных.КолвоПриход КАК КолвоПриход,
	//|	ИсточникДанных.КолвоРасход КАК КолвоРасход,
	//|	ИсточникДанных.КолвоКонечныйОстаток КАК КолвоКонечныйОстаток,
	//|	ИсточникДанных.КолвоОборот КАК КолвоОборот,
	//|	ИсточникДанных.СуммаЗакупСНДСНачальныйОстаток КАК СуммаЗакупСНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаЗакупСНДСПриход КАК СуммаЗакупСНДСПриход,
	//|	ИсточникДанных.СуммаЗакупСНДСРасход КАК СуммаЗакупСНДСРасход,
	//|	ИсточникДанных.СуммаЗакупСНДСКонечныйОстаток КАК СуммаЗакупСНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаЗакупСНДСОборот КАК СуммаЗакупСНДСОборот,
	//|	ИсточникДанных.СуммаНДСЗакупНачальныйОстаток КАК СуммаНДСЗакупНачальныйОстаток,
	//|	ИсточникДанных.СуммаНДСЗакупПриход КАК СуммаНДСЗакупПриход,
	//|	ИсточникДанных.СуммаНДСЗакупРасход КАК СуммаНДСЗакупРасход,
	//|	ИсточникДанных.СуммаНДСЗакупКонечныйОстаток КАК СуммаНДСЗакупКонечныйОстаток,
	//|	ИсточникДанных.СуммаНДСЗакупОборот КАК СуммаНДСЗакупОборот,
	//|	ИсточникДанных.СуммаРознСНДСНачальныйОстаток КАК СуммаРознСНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаРознСНДСПриход КАК СуммаРознСНДСПриход,
	//|	ИсточникДанных.СуммаРознСНДСРасход КАК СуммаРознСНДСРасход,
	//|	ИсточникДанных.СуммаРознСНДСКонечныйОстаток КАК СуммаРознСНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаРознСНДСОборот КАК СуммаРознСНДСОборот,
	//|	ИсточникДанных.СуммаРознНДСНачальныйОстаток КАК СуммаРознНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаРознНДСПриход КАК СуммаРознНДСПриход,
	//|	ИсточникДанных.СуммаРознНДСРасход КАК СуммаРознНДСРасход,
	//|	ИсточникДанных.СуммаРознНДСКонечныйОстаток КАК СуммаРознНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаРознНДСОборот КАК СуммаРознНДСОборот,
	//|	ИсточникДанных.Регистратор КАК Регистратор," + ОписаниеВыборкиВидовДокументов + ",
	//|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Регистратор) КАК РегистраторПредставление,
	//|	ИсточникДанных.Период КАК Период,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ) КАК ПериодДень,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА) КАК ПериодДекада,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ) КАК ПериодМесяц,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ) КАК ПериодКвартал,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	//|	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД) КАК ПериодГод,
	//|	ЕСТЬNULL(ДисконтныеКартыОбороты.КолвоОборот, 0) КАК КоличествоПоДисконту,
	//|	ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0) КАК СуммаСкидкиПоДисконту,
	//|	ВЫБОР
	//|		КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияККМ ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптовая ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптом
	//|			ТОГДА ИсточникДанных.СуммаРознСНДСРасход - ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0) 
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаПродажСУчетомДисконта,
	//|	ВЫБОР
	//|		КОГДА ИсточникДанных.КолвоКонечныйОстаток <> 0
	//|			ТОГДА ИсточникДанных.СуммаЗакупСНДСКонечныйОстаток / ИсточникДанных.КолвоКонечныйОстаток
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ЦенаЗакуп,
	//|	ВЫБОР
	//|		КОГДА ИсточникДанных.КолвоКонечныйОстаток <> 0
	//|			ТОГДА ИсточникДанных.СуммаРознСНДСКонечныйОстаток / ИсточникДанных.КолвоКонечныйОстаток
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ЦенаРозн
	//|{ВЫБРАТЬ
	//|	Товар.*,
	//|	Склад.*,
	//|	Партия.*,
	//|	СтавкаНДС.*,
	//|	Фирма.*,
	//|	КолвоНачальныйОстаток,
	//|	КолвоПриход,
	//|	КолвоРасход,
	//|	КолвоКонечныйОстаток,
	//|	КолвоОборот,
	//|	СуммаЗакупСНДСНачальныйОстаток,
	//|	СуммаЗакупСНДСПриход,
	//|	СуммаЗакупСНДСРасход,
	//|	СуммаЗакупСНДСКонечныйОстаток,
	//|	СуммаЗакупСНДСОборот,
	//|	СуммаНДСЗакупНачальныйОстаток,
	//|	СуммаНДСЗакупПриход,
	//|	СуммаНДСЗакупРасход,
	//|	СуммаНДСЗакупКонечныйОстаток,
	//|	СуммаНДСЗакупОборот,
	//|	СуммаРознСНДСНачальныйОстаток,
	//|	СуммаРознСНДСПриход,
	//|	СуммаРознСНДСРасход,
	//|	СуммаРознСНДСКонечныйОстаток,
	//|	СуммаРознСНДСОборот,
	//|	СуммаРознНДСНачальныйОстаток,
	//|	СуммаРознНДСПриход,
	//|	СуммаРознНДСРасход,
	//|	СуммаРознНДСКонечныйОстаток,
	//|	СуммаРознНДСОборот,
	//|	Регистратор.* КАК Регистратор,
	//|	ВидДокумента,
	//|	Период КАК Период,
	//|	ПериодДень,
	//|	ПериодНеделя,
	//|	ПериодДекада,
	//|	ПериодМесяц,
	//|	ПериодКвартал,
	//|	ПериодПолугодие,
	//|	ПериодГод,
	//|	СуммаСкидкиПоДисконту,
	//|	СуммаПродажСУчетомДисконта,
	//|	КоличествоПоДисконту,
	//|	ЦенаЗакуп,
	//|	ЦенаРозн}
	//|ИЗ
	//|	РегистрНакопления.ПартииЖНВЛС.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Товар).* КАК Товар, (Склад).* КАК Склад, (Партия).* КАК Партия, (СтавкаНДС).* КАК СтавкаНДС, (Фирма).* КАК Фирма}) КАК ИсточникДанных
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДисконтныеКарты.Обороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, {(Товар).* КАК Товар}) КАК ДисконтныеКартыОбороты
	//|		ПО ИсточникДанных.Регистратор = ДисконтныеКартыОбороты.Регистратор
	//|			И ИсточникДанных.Товар = ДисконтныеКартыОбороты.Товар И ИсточникДанных.Период = ДисконтныеКартыОбороты.Период
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ОбслуживаемыеАптеки.Аптека КАК Аптека
	//|		ИЗ
	//|			Справочник.ОбслуживаемыеАптеки КАК ОбслуживаемыеАптеки
	//|		{ГДЕ
	//|			ОбслуживаемыеАптеки.Владелец.* КАК АптекиПоставщика}
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ОбслуживаемыеАптеки.Аптека) КАК ОбслуживаемыеАптеки
	//|		ПО ИсточникДанных.Склад = ОбслуживаемыеАптеки.Аптека
	//|{ГДЕ
	//|	ИсточникДанных.КолвоНачальныйОстаток КАК КолвоНачальныйОстаток,
	//|	ИсточникДанных.КолвоПриход КАК КолвоПриход,
	//|	ИсточникДанных.КолвоРасход КАК КолвоРасход,
	//|	ИсточникДанных.КолвоКонечныйОстаток КАК КолвоКонечныйОстаток,
	//|	ИсточникДанных.КолвоОборот КАК КолвоОборот,
	//|	ИсточникДанных.СуммаЗакупСНДСНачальныйОстаток КАК СуммаЗакупСНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаЗакупСНДСПриход КАК СуммаЗакупСНДСПриход,
	//|	ИсточникДанных.СуммаЗакупСНДСРасход КАК СуммаЗакупСНДСРасход,
	//|	ИсточникДанных.СуммаЗакупСНДСКонечныйОстаток КАК СуммаЗакупСНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаЗакупСНДСОборот КАК СуммаЗакупСНДСОборот,
	//|	ИсточникДанных.СуммаНДСЗакупНачальныйОстаток КАК СуммаНДСЗакупНачальныйОстаток,
	//|	ИсточникДанных.СуммаНДСЗакупПриход КАК СуммаНДСЗакупПриход,
	//|	ИсточникДанных.СуммаНДСЗакупРасход КАК СуммаНДСЗакупРасход,
	//|	ИсточникДанных.СуммаНДСЗакупКонечныйОстаток КАК СуммаНДСЗакупКонечныйОстаток,
	//|	ИсточникДанных.СуммаНДСЗакупОборот КАК СуммаНДСЗакупОборот,
	//|	ИсточникДанных.СуммаРознСНДСНачальныйОстаток КАК СуммаРознСНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаРознСНДСПриход КАК СуммаРознСНДСПриход,
	//|	ИсточникДанных.СуммаРознСНДСРасход КАК СуммаРознСНДСРасход,
	//|	ИсточникДанных.СуммаРознСНДСКонечныйОстаток КАК СуммаРознСНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаРознСНДСОборот КАК СуммаРознСНДСОборот,
	//|	ИсточникДанных.СуммаРознНДСНачальныйОстаток КАК СуммаРознНДСНачальныйОстаток,
	//|	ИсточникДанных.СуммаРознНДСПриход КАК СуммаРознНДСПриход,
	//|	ИсточникДанных.СуммаРознНДСРасход КАК СуммаРознНДСРасход,
	//|	ИсточникДанных.СуммаРознНДСКонечныйОстаток КАК СуммаРознНДСКонечныйОстаток,
	//|	ИсточникДанных.СуммаРознНДСОборот КАК СуммаРознНДСОборот,
	//|	ИсточникДанных.Регистратор.* КАК Регистратор," + ОписаниеОтборовВидовДокументов + ",
	//|	ИсточникДанных.Период КАК Период,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ)) КАК ПериодДень,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА)) КАК ПериодДекада,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ)) КАК ПериодМесяц,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ)) КАК ПериодКвартал,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	//|	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)) КАК ПериодГод,
	//|	(ЕСТЬNULL(ДисконтныеКартыОбороты.КолвоОборот, 0)) КАК КоличествоПоДисконту,
	//|	(ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0)) КАК СуммаСкидкиПоДисконту,
	//|	(ВЫБОР
	//|			КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияККМ ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптовая ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптом
	//|				ТОГДА ИсточникДанных.СуммаРознСНДСРасход - ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0) 
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК СуммаПродажСУчетомДисконта,
	//|	(ВЫБОР
	//|			КОГДА ИсточникДанных.КолвоКонечныйОстаток <> 0
	//|				ТОГДА ИсточникДанных.СуммаЗакупСНДСКонечныйОстаток / ИсточникДанных.КолвоКонечныйОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ЦенаЗакуп,
	//|	(ВЫБОР
	//|			КОГДА ИсточникДанных.КолвоКонечныйОстаток <> 0
	//|				ТОГДА ИсточникДанных.СуммаРознСНДСКонечныйОстаток / ИсточникДанных.КолвоКонечныйОстаток
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ЦенаРозн}
	//|{УПОРЯДОЧИТЬ ПО
	//|	Товар.*,
	//|	Склад.*,
	//|	Партия.*,
	//|	СтавкаНДС.*,
	//|	Фирма.*,
	//|	КолвоНачальныйОстаток,
	//|	КолвоПриход,
	//|	КолвоРасход,
	//|	КолвоКонечныйОстаток,
	//|	КолвоОборот,
	//|	СуммаЗакупСНДСНачальныйОстаток,
	//|	СуммаЗакупСНДСПриход,
	//|	СуммаЗакупСНДСРасход,
	//|	СуммаЗакупСНДСКонечныйОстаток,
	//|	СуммаЗакупСНДСОборот,
	//|	СуммаНДСЗакупНачальныйОстаток,
	//|	СуммаНДСЗакупПриход,
	//|	СуммаНДСЗакупРасход,
	//|	СуммаНДСЗакупКонечныйОстаток,
	//|	СуммаНДСЗакупОборот,
	//|	СуммаРознСНДСНачальныйОстаток,
	//|	СуммаРознСНДСПриход,
	//|	СуммаРознСНДСРасход,
	//|	СуммаРознСНДСКонечныйОстаток,
	//|	СуммаРознСНДСОборот,
	//|	СуммаРознНДСНачальныйОстаток,
	//|	СуммаРознНДСПриход,
	//|	СуммаРознНДСРасход,
	//|	СуммаРознНДСКонечныйОстаток,
	//|	СуммаРознНДСОборот,
	//|	Регистратор.*,
	//|	Период,
	//|	ПериодДень,
	//|	ПериодНеделя,
	//|	ПериодДекада,
	//|	ПериодМесяц,
	//|	ПериодКвартал,
	//|	ПериодПолугодие,
	//|	ПериодГод,
	//|	КоличествоПоДисконту,
	//|	СуммаСкидкиПоДисконту,
	//|	СуммаПродажСУчетомДисконта,
	//|	ЦенаЗакуп,
	//|	ЦенаРозн}
	//|ИТОГИ
	//|	СУММА(КолвоНачальныйОстаток),
	//|	СУММА(КолвоПриход),
	//|	СУММА(КолвоРасход),
	//|	СУММА(КолвоКонечныйОстаток),
	//|	СУММА(КолвоОборот),
	//|	СУММА(СуммаЗакупСНДСНачальныйОстаток),
	//|	СУММА(СуммаЗакупСНДСПриход),
	//|	СУММА(СуммаЗакупСНДСРасход),
	//|	СУММА(СуммаЗакупСНДСКонечныйОстаток),
	//|	СУММА(СуммаЗакупСНДСОборот),
	//|	СУММА(СуммаНДСЗакупНачальныйОстаток),
	//|	СУММА(СуммаНДСЗакупПриход),
	//|	СУММА(СуммаНДСЗакупРасход),
	//|	СУММА(СуммаНДСЗакупКонечныйОстаток),
	//|	СУММА(СуммаНДСЗакупОборот),
	//|	СУММА(СуммаРознСНДСНачальныйОстаток),
	//|	СУММА(СуммаРознСНДСПриход),
	//|	СУММА(СуммаРознСНДСРасход),
	//|	СУММА(СуммаРознСНДСКонечныйОстаток),
	//|	СУММА(СуммаРознСНДСОборот),
	//|	СУММА(СуммаРознНДСНачальныйОстаток),
	//|	СУММА(СуммаРознНДСПриход),
	//|	СУММА(СуммаРознНДСРасход),
	//|	СУММА(СуммаРознНДСКонечныйОстаток),
	//|	СУММА(СуммаРознНДСОборот),
	//|	СУММА(КоличествоПоДисконту),
	//|	СУММА(СуммаСкидкиПоДисконту),
	//|	СУММА(СуммаПродажСУчетомДисконта),
	//|	ВЫБОР
	//|		КОГДА СУММА(КолвоКонечныйОстаток) <> 0
	//|			ТОГДА СУММА(СуммаЗакупСНДСКонечныйОстаток) / СУММА(КолвоКонечныйОстаток)
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ЦенаЗакуп,
	//|	ВЫБОР
	//|		КОГДА СУММА(КолвоКонечныйОстаток) <> 0
	//|			ТОГДА СУММА(СуммаРознСНДСКонечныйОстаток) / СУММА(КолвоКонечныйОстаток)
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ЦенаРозн
	//|ПО
	//|	ОБЩИЕ
	//|{ИТОГИ ПО
	//|	Товар.*,
	//|	Склад.*,
	//|	Партия.*,
	//|	СтавкаНДС.*,
	//|	Фирма.*,
	//|	Регистратор.*,
	//|	ВидДокумента,
	//|	Период,
	//|	ПериодДень,
	//|	ПериодНеделя,
	//|	ПериодДекада,
	//|	ПериодМесяц,
	//|	ПериодКвартал,
	//|	ПериодПолугодие,
	//|	ПериодГод}";
	
	ТекстЗапроса = ПолучитьТекстЗапроса(ОписаниеВыборкиВидовДокументов, ОписаниеОтборовВидовДокументов);
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтавкаНДС", "Ставка НДС");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КолвоНачальныйОстаток", "Кол-во нач. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КолвоПриход", "Кол-во приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КолвоРасход", "Кол-во расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КолвоКонечныйОстаток", "Кол-во кон. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КолвоОборот", "Кол-во оборот");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаЗакупСНДСНачальныйОстаток", "Сумма закуп. нач. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаЗакупСНДСПриход", "Сумма закуп. приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаЗакупСНДСРасход", "Сумма закуп. расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаЗакупСНДСКонечныйОстаток", "Сумма закуп. кон. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаЗакупСНДСОборот", "Сумма закуп. оборот");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДСЗакупНачальныйОстаток", "Сумма НДС закуп. нач. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДСЗакупПриход", "Сумма НДС закуп. приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДСЗакупРасход", "Сумма НДС закуп. расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДСЗакупКонечныйОстаток", "Сумма НДС закуп. кон. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДСЗакупОборот", "Сумма НДС закуп. оборот");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознСНДСНачальныйОстаток", "Сумма розн. нач. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознСНДСПриход", "Сумма розн. приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознСНДСРасход", "Сумма розн. расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознСНДСКонечныйОстаток", "Сумма розн. кон. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознСНДСОборот", "Сумма розн. оборот");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознНДСНачальныйОстаток", "Сумма НДС розн. нач. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознНДСПриход", "Сумма НДС розн. приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознНДСРасход", "Сумма НДС розн. расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознНДСКонечныйОстаток", "Сумма НДС розн. кон. ост.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРознНДСОборот", "Сумма НДС розн. оборот");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПоДисконту", "Продано по дисконту");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаСкидкиПоДисконту", "Скидка по дисконту");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПродажСУчетомДисконта", "Продажа с учетом дисконта");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦенаЗакуп", "Цена закуп.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦенаРозн", "Цена розн.");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("КолвоНачальныйОстаток", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "НачальныйОстаток", "Нач. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаЗакупСНДСНачальныйОстаток", "Сумма закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", "Нач. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДСЗакупНачальныйОстаток", "Сумма НДС закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", "Нач. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознСНДСНачальныйОстаток", "Сумма розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", "Нач. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознНДСНачальныйОстаток", "Сумма НДС розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", "Нач. ост.");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КолвоПриход", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаЗакупСНДСПриход", "Сумма закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДСЗакупПриход", "Сумма НДС закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознСНДСПриход", "Сумма розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознНДСПриход", "Сумма НДС розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КолвоРасход", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаЗакупСНДСРасход", "Сумма закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДСЗакупРасход", "Сумма НДС закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознСНДСРасход", "Сумма розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознНДСРасход", "Сумма НДС розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КолвоКонечныйОстаток", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "КонечныйОстаток", "Кон. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаЗакупСНДСКонечныйОстаток", "Сумма закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", "Кон. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДСЗакупКонечныйОстаток", "Сумма НДС закуп.", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", "Кон. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознСНДСКонечныйОстаток", "Сумма розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", "Кон. ост.");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРознНДСКонечныйОстаток", "Сумма НДС розн.", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", "Кон. ост.");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПоДисконту", "Количество", Ложь, "ЧЦ=15; ЧДЦ=3", "Дисконт", "Продажи с дисконтом");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаСкидкиПоДисконту", "Скидка", Ложь, "ЧЦ=15; ЧДЦ=2", "Дисконт", "Продажи с дисконтом");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПродажСУчетомДисконта", "Сумма", Ложь, "ЧЦ=15; ЧДЦ=2", "Дисконт", "Продажи с дисконтом");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЦенаЗакуп", "Цена закуп.", Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦенаРозн", "Цена розн.", Истина, "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Товар");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Товар");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
		
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

Функция ПолучитьТекстЗапроса(ОписаниеВыборкиВидовДокументов, ОписаниеОтборовВидовДокументов)
	
	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Товар,
	|	ВложенныйЗапрос.Товар.Представление,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Склад.Представление,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.Партия.Представление,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.СтавкаНДС.Представление,
	|	ВложенныйЗапрос.Фирма,
	|	ВложенныйЗапрос.Фирма.Представление,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.ВидДокумента,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	СУММА(ВложенныйЗапрос.КолвоНачальныйОстаток) КАК КолвоНачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаЗакупСНДСНачальныйОстаток) КАК СуммаЗакупСНДСНачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаНДСЗакупНачальныйОстаток) КАК СуммаНДСЗакупНачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаРознСНДСНачальныйОстаток) КАК СуммаРознСНДСНачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаРознНДСНачальныйОстаток) КАК СуммаРознНДСНачальныйОстаток,
	|	СУММА(ВложенныйЗапрос.КолвоПриход) КАК КолвоПриход,
	|	СУММА(ВложенныйЗапрос.КолвоРасход) КАК КолвоРасход,
	|	СУММА(ВложенныйЗапрос.КолвоОборот) КАК КолвоОборот,
	|	СУММА(ВложенныйЗапрос.СуммаЗакупСНДСПриход) КАК СуммаЗакупСНДСПриход,
	|	СУММА(ВложенныйЗапрос.СуммаЗакупСНДСРасход) КАК СуммаЗакупСНДСРасход,
	|	СУММА(ВложенныйЗапрос.СуммаЗакупСНДСОборот) КАК СуммаЗакупСНДСОборот,
	|	СУММА(ВложенныйЗапрос.СуммаНДСЗакупПриход) КАК СуммаНДСЗакупПриход,
	|	СУММА(ВложенныйЗапрос.СуммаНДСЗакупРасход) КАК СуммаНДСЗакупРасход,
	|	СУММА(ВложенныйЗапрос.СуммаНДСЗакупОборот) КАК СуммаНДСЗакупОборот,
	|	СУММА(ВложенныйЗапрос.СуммаРознСНДСПриход) КАК СуммаРознСНДСПриход,
	|	СУММА(ВложенныйЗапрос.СуммаРознСНДСРасход) КАК СуммаРознСНДСРасход,
	|	СУММА(ВложенныйЗапрос.СуммаРознСНДСОборот) КАК СуммаРознСНДСОборот,
	|	СУММА(ВложенныйЗапрос.СуммаРознНДСПриход) КАК СуммаРознНДСПриход,
	|	СУММА(ВложенныйЗапрос.СуммаРознНДСРасход) КАК СуммаРознНДСРасход,
	|	СУММА(ВложенныйЗапрос.СуммаРознНДСОборот) КАК СуммаРознНДСОборот,
	|	СУММА(ВложенныйЗапрос.КолвоКонечныйОстаток) КАК КолвоКонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаЗакупСНДСКонечныйОстаток) КАК СуммаЗакупСНДСКонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаНДСЗакупКонечныйОстаток) КАК СуммаНДСЗакупКонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаРознСНДСКонечныйОстаток) КАК СуммаРознСНДСКонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.СуммаРознНДСКонечныйОстаток) КАК СуммаРознНДСКонечныйОстаток,
	|	СУММА(ВложенныйЗапрос.КоличествоПоДисконту) КАК КоличествоПоДисконту,
	|	СУММА(ВложенныйЗапрос.СуммаСкидкиПоДисконту) КАК СуммаСкидкиПоДисконту,
	|	СУММА(ВложенныйЗапрос.СуммаПродажСУчетомДисконта) КАК СуммаПродажСУчетомДисконта,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.КолвоКонечныйОстаток <> 0
	|				ТОГДА ВложенныйЗапрос.СуммаЗакупСНДСКонечныйОстаток / ВложенныйЗапрос.КолвоКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаЗакуп,
	|	СУММА(ВЫБОР
	|			КОГДА ВложенныйЗапрос.КолвоКонечныйОстаток <> 0
	|				ТОГДА ВложенныйЗапрос.СуммаРознСНДСКонечныйОстаток / ВложенныйЗапрос.КолвоКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаРозн
	|{ВЫБРАТЬ
	|	Товар.*,
	|	Склад.*,
	|	Партия.*,
	|	СтавкаНДС.*,
	|	Фирма.*,
	|	Регистратор.*,
	|	ВидДокумента,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	КолвоНачальныйОстаток,
	|	СуммаЗакупСНДСНачальныйОстаток,
	|	СуммаНДСЗакупНачальныйОстаток,
	|	СуммаРознСНДСНачальныйОстаток,
	|	СуммаРознНДСНачальныйОстаток,
	|	КолвоПриход,
	|	КолвоРасход,
	|	КолвоОборот,
	|	СуммаЗакупСНДСПриход,
	|	СуммаЗакупСНДСРасход,
	|	СуммаЗакупСНДСОборот,
	|	СуммаНДСЗакупПриход,
	|	СуммаНДСЗакупРасход,
	|	СуммаНДСЗакупОборот,
	|	СуммаРознСНДСПриход,
	|	СуммаРознСНДСРасход,
	|	СуммаРознСНДСОборот,
	|	СуммаРознНДСПриход,
	|	СуммаРознНДСРасход,
	|	СуммаРознНДСОборот,
	|	КолвоКонечныйОстаток,
	|	СуммаЗакупСНДСКонечныйОстаток,
	|	СуммаНДСЗакупКонечныйОстаток,
	|	СуммаРознСНДСКонечныйОстаток,
	|	СуммаРознНДСКонечныйОстаток,
	|	КоличествоПоДисконту,
	|	СуммаСкидкиПоДисконту,
	|	СуммаПродажСУчетомДисконта,
	|	ЦенаЗакуп,
	|	ЦенаРозн}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПартииЖНВЛСОстатки.Товар КАК Товар,
	|		ПартииЖНВЛСОстатки.Склад КАК Склад,
	|		ПартииЖНВЛСОстатки.Партия КАК Партия,
	|		ПартииЖНВЛСОстатки.СтавкаНДС КАК СтавкаНДС,
	|		ПартииЖНВЛСОстатки.Фирма КАК Фирма,
	|		СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) КАК КолвоНачальныйОстаток,
	|		СУММА(ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток) КАК СуммаЗакупСНДСНачальныйОстаток,
	|		СУММА(ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток) КАК СуммаНДСЗакупНачальныйОстаток,
	|		СУММА(ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток) КАК СуммаРознСНДСНачальныйОстаток,
	|		СУММА(ПартииЖНВЛСОстатки.СуммаРознНДСОстаток) КАК СуммаРознНДСНачальныйОстаток,
	|		NULL КАК Регистратор,
	|		NULL КАК ВидДокумента,
	|		NULL КАК Период,
	|		NULL КАК ПериодДень,
	|		NULL КАК ПериодНеделя,
	|		NULL КАК ПериодДекада,
	|		NULL КАК ПериодМесяц,
	|		NULL КАК ПериодКвартал,
	|		NULL КАК ПериодПолугодие,
	|		NULL КАК ПериодГод,
	|		СУММА(0) КАК КолвоПриход,
	|		СУММА(0) КАК КолвоРасход,
	|		СУММА(0) КАК КолвоОборот,
	|		СУММА(0) КАК СуммаЗакупСНДСПриход,
	|		СУММА(0) КАК СуммаЗакупСНДСРасход,
	|		СУММА(0) КАК СуммаЗакупСНДСОборот,
	|		СУММА(0) КАК СуммаНДСЗакупПриход,
	|		СУММА(0) КАК СуммаНДСЗакупРасход,
	|		СУММА(0) КАК СуммаНДСЗакупОборот,
	|		СУММА(0) КАК СуммаРознСНДСПриход,
	|		СУММА(0) КАК СуммаРознСНДСРасход,
	|		СУММА(0) КАК СуммаРознСНДСОборот,
	|		СУММА(0) КАК СуммаРознНДСПриход,
	|		СУММА(0) КАК СуммаРознНДСРасход,
	|		СУММА(0) КАК СуммаРознНДСОборот,
	|		СУММА(0) КАК КолвоКонечныйОстаток,
	|		СУММА(0) КАК СуммаЗакупСНДСКонечныйОстаток,
	|		СУММА(0) КАК СуммаНДСЗакупКонечныйОстаток,
	|		СУММА(0) КАК СуммаРознСНДСКонечныйОстаток,
	|		СУММА(0) КАК СуммаРознНДСКонечныйОстаток,
	|		СУММА(0) КАК КоличествоПоДисконту,
	|		СУММА(0) КАК СуммаСкидкиПоДисконту,
	|		СУММА(0) КАК СуммаПродажСУчетомДисконта
	|	{ВЫБРАТЬ
	|		Товар.*,
	|		Склад.*,
	|		Партия.*,
	|		СтавкаНДС.*,
	|		Фирма.*}
	|	ИЗ
	|		РегистрНакопления.ПартииЖНВЛС.Остатки(&ДатаНач, 1 = 1 {(Товар).* КАК Товар, (Склад).* КАК Склад, (Партия).* КАК Партия, (СтавкаНДС).* КАК СтавкаНДС, (Фирма).* КАК Фирма}) КАК ПартииЖНВЛСОстатки
	|	{ГДЕ
	|		ПартииЖНВЛСОстатки.Товар.*,
	|		ПартииЖНВЛСОстатки.Склад.*,
	|		ПартииЖНВЛСОстатки.Партия.*,
	|		ПартииЖНВЛСОстатки.СтавкаНДС.*,
	|		ПартииЖНВЛСОстатки.Фирма.*,
	|		ПартииЖНВЛСОстатки.КолвоОстаток КАК КолвоНачальныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток КАК СуммаЗакупСНДСНачальныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток КАК СуммаНДСЗакупНачальныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток КАК СуммаРознСНДСНачальныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаРознНДСОстаток КАК СуммаРознНДСНачальныйОстаток}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПартииЖНВЛСОстатки.Товар,
	|		ПартииЖНВЛСОстатки.Склад,
	|		ПартииЖНВЛСОстатки.Партия,
	|		ПартииЖНВЛСОстатки.СтавкаНДС,
	|		ПартииЖНВЛСОстатки.Фирма
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсточникДанных.Товар,
	|		ИсточникДанных.Склад,
	|		ИсточникДанных.Партия,
	|		ИсточникДанных.СтавкаНДС,
	|		ИсточникДанных.Фирма,
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		ИсточникДанных.Регистратор," + ОписаниеВыборкиВидовДокументов + ",
	|		ИсточникДанных.Период,
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД),
	|		СУММА(ИсточникДанных.КолвоПриход),
	|		СУММА(ИсточникДанных.КолвоРасход),
	|		СУММА(ИсточникДанных.КолвоОборот),
	|		СУММА(ИсточникДанных.СуммаЗакупСНДСПриход),
	|		СУММА(ИсточникДанных.СуммаЗакупСНДСРасход),
	|		СУММА(ИсточникДанных.СуммаЗакупСНДСОборот),
	|		СУММА(ИсточникДанных.СуммаНДСЗакупПриход),
	|		СУММА(ИсточникДанных.СуммаНДСЗакупРасход),
	|		СУММА(ИсточникДанных.СуммаНДСЗакупОборот),
	|		СУММА(ИсточникДанных.СуммаРознСНДСПриход),
	|		СУММА(ИсточникДанных.СуммаРознСНДСРасход),
	|		СУММА(ИсточникДанных.СуммаРознСНДСОборот),
	|		СУММА(ИсточникДанных.СуммаРознНДСПриход),
	|		СУММА(ИсточникДанных.СуммаРознНДСРасход),
	|		СУММА(ИсточникДанных.СуммаРознНДСОборот),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(ЕСТЬNULL(ДисконтныеКартыОбороты.КолвоОборот, 0)),
	|		СУММА(ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0)),
	|		СУММА(ВЫБОР
	|				КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияККМ
	|						ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптовая
	|						ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптом
	|					ТОГДА ИсточникДанных.СуммаРознСНДСРасход - ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ)
	|	{ВЫБРАТЬ
	|		Товар.*,
	|		Склад.*,
	|		Партия.*,
	|		СтавкаНДС.*,
	|		Фирма.*,
	|		Регистратор.*,
	|		ВидДокумента,
	|		Период,
	|		ПериодДень,
	|		ПериодНеделя,
	|		ПериодДекада,
	|		ПериодМесяц,
	|		ПериодКвартал,
	|		ПериодПолугодие,
	|		ПериодГод}
	|	ИЗ
	|		РегистрНакопления.ПартииЖНВЛС.Обороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, 1 = 1 {(Товар).* КАК Товар, (Склад).* КАК Склад, (Партия).* КАК Партия, (СтавкаНДС).* КАК СтавкаНДС, (Фирма).* КАК Фирма}) КАК ИсточникДанных
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДисконтныеКарты.Обороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, {(Товар).* КАК Товар}) КАК ДисконтныеКартыОбороты
	|			ПО ИсточникДанных.Период = ДисконтныеКартыОбороты.Период
	|				И ИсточникДанных.Регистратор = ДисконтныеКартыОбороты.Регистратор
	|				И ИсточникДанных.Товар = ДисконтныеКартыОбороты.Товар
	|	{ГДЕ
	|		ИсточникДанных.Товар.*,
	|		ИсточникДанных.Склад.*,
	|		ИсточникДанных.Партия.*,
	|		ИсточникДанных.СтавкаНДС.*,
	|		ИсточникДанных.Фирма.*,
	|		ИсточникДанных.Регистратор.*," + ОписаниеОтборовВидовДокументов + ",
	|		ИсточникДанных.Период,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ)) КАК ПериодДень,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА)) КАК ПериодДекада,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ)) КАК ПериодМесяц,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ)) КАК ПериодКвартал,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|		(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)) КАК ПериодГод,
	|		ИсточникДанных.КолвоПриход,
	|		ИсточникДанных.КолвоРасход,
	|		ИсточникДанных.КолвоОборот,
	|		ИсточникДанных.СуммаЗакупСНДСПриход,
	|		ИсточникДанных.СуммаЗакупСНДСРасход,
	|		ИсточникДанных.СуммаЗакупСНДСОборот,
	|		ИсточникДанных.СуммаНДСЗакупПриход,
	|		ИсточникДанных.СуммаНДСЗакупРасход,
	|		ИсточникДанных.СуммаНДСЗакупОборот,
	|		ИсточникДанных.СуммаРознСНДСПриход,
	|		ИсточникДанных.СуммаРознСНДСРасход,
	|		ИсточникДанных.СуммаРознСНДСОборот,
	|		ИсточникДанных.СуммаРознНДСПриход,
	|		ИсточникДанных.СуммаРознНДСРасход,
	|		ИсточникДанных.СуммаРознНДСОборот,
	|		(ЕСТЬNULL(ДисконтныеКартыОбороты.КолвоОборот, 0)) КАК КоличествоПоДисконту,
	|		(ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0)) КАК СуммаСкидкиПоДисконту,
	|		(ВЫБОР
	|				КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияККМ
	|						ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптовая
	|						ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.РеализацияОптом
	|					ТОГДА ИсточникДанных.СуммаРознСНДСРасход - ЕСТЬNULL(ДисконтныеКартыОбороты.СуммаСкидкиОборот, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК СуммаПродажСУчетомДисконта}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ИсточникДанных.Товар,
	|		ИсточникДанных.Склад,
	|		ИсточникДанных.Партия,
	|		ИсточникДанных.СтавкаНДС,
	|		ИсточникДанных.Фирма,
	|		ИсточникДанных.Регистратор,
	|		ИсточникДанных.Период,
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ),
	|		НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПартииЖНВЛСОстатки.Товар,
	|		ПартииЖНВЛСОстатки.Склад,
	|		ПартииЖНВЛСОстатки.Партия,
	|		ПартииЖНВЛСОстатки.СтавкаНДС,
	|		ПартииЖНВЛСОстатки.Фирма,
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(ПартииЖНВЛСОстатки.КолвоОстаток),
	|		СУММА(ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток),
	|		СУММА(ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток),
	|		СУММА(ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток),
	|		СУММА(ПартииЖНВЛСОстатки.СуммаРознНДСОстаток),
	|		СУММА(0),
	|		СУММА(0),
	|		СУММА(0)
	|	{ВЫБРАТЬ
	|		Товар.*,
	|		Склад.*,
	|		Партия.*,
	|		СтавкаНДС.*,
	|		Фирма.*}
	|	ИЗ
	|		РегистрНакопления.ПартииЖНВЛС.Остатки(&ДатаКон, 1 = 1 {(Товар).* КАК Товар, (Склад).* КАК Склад, (Партия).* КАК Партия, (СтавкаНДС).* КАК СтавкаНДС, (Фирма).* КАК Фирма}) КАК ПартииЖНВЛСОстатки
	|	{ГДЕ
	|		ПартииЖНВЛСОстатки.Товар.*,
	|		ПартииЖНВЛСОстатки.Склад.*,
	|		ПартииЖНВЛСОстатки.Партия.*,
	|		ПартииЖНВЛСОстатки.СтавкаНДС.*,
	|		ПартииЖНВЛСОстатки.Фирма.*,
	|		ПартииЖНВЛСОстатки.КолвоОстаток КАК КолвоКонечныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток КАК СуммаЗакупСНДСКонечныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток КАК СуммаНДСЗакупКонечныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток КАК СуммаРознСНДСКонечныйОстаток,
	|		ПартииЖНВЛСОстатки.СуммаРознНДСОстаток КАК СуммаРознНДСКонечныйОстаток}
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПартииЖНВЛСОстатки.Товар,
	|		ПартииЖНВЛСОстатки.Склад,
	|		ПартииЖНВЛСОстатки.Партия,
	|		ПартииЖНВЛСОстатки.СтавкаНДС,
	|		ПартииЖНВЛСОстатки.Фирма) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Товар.*,
	|	ВложенныйЗапрос.Склад.*,
	|	ВложенныйЗапрос.Партия.*,
	|	ВложенныйЗапрос.СтавкаНДС.*,
	|	ВложенныйЗапрос.Фирма.*,
	|	ВложенныйЗапрос.Регистратор.*,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	ВложенныйЗапрос.КолвоНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаЗакупСНДСНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаНДСЗакупНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаРознСНДСНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаРознНДСНачальныйОстаток,
	|	ВложенныйЗапрос.КолвоПриход,
	|	ВложенныйЗапрос.КолвоРасход,
	|	ВложенныйЗапрос.КолвоОборот,
	|	ВложенныйЗапрос.СуммаЗакупСНДСПриход,
	|	ВложенныйЗапрос.СуммаЗакупСНДСРасход,
	|	ВложенныйЗапрос.СуммаЗакупСНДСОборот,
	|	ВложенныйЗапрос.СуммаНДСЗакупПриход,
	|	ВложенныйЗапрос.СуммаНДСЗакупРасход,
	|	ВложенныйЗапрос.СуммаНДСЗакупОборот,
	|	ВложенныйЗапрос.СуммаРознСНДСПриход,
	|	ВложенныйЗапрос.СуммаРознСНДСРасход,
	|	ВложенныйЗапрос.СуммаРознСНДСОборот,
	|	ВложенныйЗапрос.СуммаРознНДСПриход,
	|	ВложенныйЗапрос.СуммаРознНДСРасход,
	|	ВложенныйЗапрос.СуммаРознНДСОборот,
	|	ВложенныйЗапрос.КолвоКонечныйОстаток,
	|	ВложенныйЗапрос.СуммаЗакупСНДСКонечныйОстаток,
	|	ВложенныйЗапрос.СуммаНДСЗакупКонечныйОстаток,
	|	ВложенныйЗапрос.СуммаРознСНДСКонечныйОстаток,
	|	ВложенныйЗапрос.СуммаРознНДСКонечныйОстаток,
	|	ВложенныйЗапрос.КоличествоПоДисконту,
	|	ВложенныйЗапрос.СуммаСкидкиПоДисконту,
	|	ВложенныйЗапрос.СуммаПродажСУчетомДисконта,
	|	(ВЫБОР
	|			КОГДА ВложенныйЗапрос.КолвоКонечныйОстаток <> 0
	|				ТОГДА ВложенныйЗапрос.СуммаЗакупСНДСКонечныйОстаток / ВложенныйЗапрос.КолвоКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаЗакуп,
	|	(ВЫБОР
	|			КОГДА ВложенныйЗапрос.КолвоКонечныйОстаток <> 0
	|				ТОГДА ВложенныйЗапрос.СуммаРознСНДСКонечныйОстаток / ВложенныйЗапрос.КолвоКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаРозн}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Товар,
	|	ВложенныйЗапрос.Товар.Представление,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Склад.Представление,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.Партия.Представление,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.СтавкаНДС.Представление,
	|	ВложенныйЗапрос.Фирма,
	|	ВложенныйЗапрос.Фирма.Представление,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.ВидДокумента,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод
	|{УПОРЯДОЧИТЬ ПО
	|	Товар.*,
	|	Склад.*,
	|	Партия.*,
	|	СтавкаНДС.*,
	|	Фирма.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	КолвоНачальныйОстаток,
	|	СуммаЗакупСНДСНачальныйОстаток,
	|	СуммаНДСЗакупНачальныйОстаток,
	|	СуммаРознСНДСНачальныйОстаток,
	|	СуммаРознНДСНачальныйОстаток,
	|	КолвоПриход,
	|	КолвоРасход,
	|	КолвоОборот,
	|	СуммаЗакупСНДСПриход,
	|	СуммаЗакупСНДСРасход,
	|	СуммаЗакупСНДСОборот,
	|	СуммаНДСЗакупПриход,
	|	СуммаНДСЗакупРасход,
	|	СуммаНДСЗакупОборот,
	|	СуммаРознСНДСПриход,
	|	СуммаРознСНДСРасход,
	|	СуммаРознСНДСОборот,
	|	СуммаРознНДСПриход,
	|	СуммаРознНДСРасход,
	|	СуммаРознНДСОборот,
	|	КолвоКонечныйОстаток,
	|	СуммаЗакупСНДСКонечныйОстаток,
	|	СуммаНДСЗакупКонечныйОстаток,
	|	СуммаРознСНДСКонечныйОстаток,
	|	СуммаРознНДСКонечныйОстаток,
	|	КоличествоПоДисконту,
	|	СуммаСкидкиПоДисконту,
	|	СуммаПродажСУчетомДисконта,
	|	ЦенаЗакуп,
	|	ЦенаРозн}
	|ИТОГИ
	|	СУММА(КолвоНачальныйОстаток),
	|	СУММА(СуммаЗакупСНДСНачальныйОстаток),
	|	СУММА(СуммаНДСЗакупНачальныйОстаток),
	|	СУММА(СуммаРознСНДСНачальныйОстаток),
	|	СУММА(СуммаРознНДСНачальныйОстаток),
	|	СУММА(КолвоПриход),
	|	СУММА(КолвоРасход),
	|	СУММА(КолвоОборот),
	|	СУММА(СуммаЗакупСНДСПриход),
	|	СУММА(СуммаЗакупСНДСРасход),
	|	СУММА(СуммаЗакупСНДСОборот),
	|	СУММА(СуммаНДСЗакупПриход),
	|	СУММА(СуммаНДСЗакупРасход),
	|	СУММА(СуммаНДСЗакупОборот),
	|	СУММА(СуммаРознСНДСПриход),
	|	СУММА(СуммаРознСНДСРасход),
	|	СУММА(СуммаРознСНДСОборот),
	|	СУММА(СуммаРознНДСПриход),
	|	СУММА(СуммаРознНДСРасход),
	|	СУММА(СуммаРознНДСОборот),
	|	СУММА(КолвоКонечныйОстаток),
	|	СУММА(СуммаЗакупСНДСКонечныйОстаток),
	|	СУММА(СуммаНДСЗакупКонечныйОстаток),
	|	СУММА(СуммаРознСНДСКонечныйОстаток),
	|	СУММА(СуммаРознНДСКонечныйОстаток),
	|	СУММА(КоличествоПоДисконту),
	|	СУММА(СуммаСкидкиПоДисконту),
	|	СУММА(СуммаПродажСУчетомДисконта),
	|	ВЫБОР
	|		КОГДА СУММА(КолвоКонечныйОстаток) <> 0
	|			ТОГДА СУММА(СуммаЗакупСНДСКонечныйОстаток) / СУММА(КолвоКонечныйОстаток)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаЗакуп,
	|	ВЫБОР
	|		КОГДА СУММА(КолвоКонечныйОстаток) <> 0
	|			ТОГДА СУММА(СуммаРознСНДСКонечныйОстаток) / СУММА(КолвоКонечныйОстаток)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаРозн
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Товар.*,
	|	Склад.*,
	|	Партия.*,
	|	СтавкаНДС.*,
	|	Фирма.*,
	|	Регистратор.*,
	|	ВидДокумента,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}";
	
	Возврат Текст;
	
КонецФункции

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

УниверсальныйОтчет.мСтруктураПериодов.Вставить("СуммаСкидкиПоДисконту", 13);
УниверсальныйОтчет.мСтруктураПериодов.Вставить("КоличествоПоДисконту", 13);
УниверсальныйОтчет.мСтруктураПериодов.Вставить("СуммаПродажСУчетомДисконта", 13);

#КонецЕсли
